flysight/flysight-2-firmware/STM32_WPAN/App/app_ble.c
  ble_count_bonded_devices();

  if (request_pairing)
  {
    /* Start Fast or Low Power Advertising */
    ret = aci_gap_set_limited_discoverable(ADV_IND,
                                           Min_Inter,
                                           Max_Inter,
                                           CFG_BLE_ADDRESS_TYPE,
                                           ADV_FILTER,
                                           0,
                                           0,
                                           0,
                                           0,
                                           0,
                                           0);
    if (ret != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("==>> aci_gap_set_limited_discoverable - fail, result: 0x%x \n", ret);
    }
    else
    {
      APP_DBG_MSG("==>> aci_gap_set_limited_discoverable - Success\n");
    }

    /* Update Advertising data */
    ret = aci_gap_update_adv_data(sizeof(a_AdvData), (uint8_t*) a_AdvData);
    if (ret != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("==>> aci_gap_update_adv_data - fail, result: 0x%x \n", ret);
    }
    else
    {
      APP_DBG_MSG("==>> aci_gap_update_adv_data - Success\n");
    }
  }
  else
  {
    /* Start Fast or Low Power Advertising */
    ret = aci_gap_set_undirected_connectable(Min_Inter,
                                             Max_Inter,
                                             CFG_BLE_ADDRESS_TYPE,
                                             HCI_ADV_FILTER_WHITELIST_SCAN_CONNECT);
    if (ret != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("==>> aci_gap_set_undirected_connectable - fail, result: 0x%x \n", ret);
    }
    else
    {
      APP_DBG_MSG("==>> aci_gap_set_undirected_connectable - Success\n");
    }
  }

  if (NewStatus == APP_BLE_FAST_ADV)
  {
    HW_TS_Start(BleApplicationContext.Advertising_mgr_timer_Id, FAST_ADV_TIMEOUT);
  }

  return;
}

static void Adv_Update_Req(void)
{
  /**
   * The code shall be executed in the background as an aci command may be sent
   * The background is the only place where the application can make sure a new aci command
   * is not sent if there is a pending one
   */
  UTIL_SEQ_SetTask(1 << CFG_TASK_ADV_UPDATE_ID, CFG_SCH_PRIO_1);
}

static void Adv_Update(void)
{
  FS_Adv_Request(APP_BLE_LP_ADV);
}

void APP_BLE_RequestPairing(void (*Callback)(void))
{
  /* Prepare for pairing request */
  Next_Adv_Callback = Callback;
  request_pairing = 1;

  /* Request fast advertising */
  FS_Adv_Request(APP_BLE_FAST_ADV);
}

void APP_BLE_CancelPairing(void)
{
  /* Prepare for pairing request */
  Next_Adv_Callback = 0;
  request_pairing = 0;

  if (BleApplicationContext.Device_Connection_Status == APP_BLE_FAST_ADV)
  {
    /* Request low power advertising */
    FS_Adv_Request(APP_BLE_LP_ADV);
  }
}

void APP_BLE_UpdateDeviceName(void)
{
  const char *name = FS_State_Get()->device_name;
  tBleStatus ret;

  if (BleApplicationContext.BleApplicationContext_legacy.gapServiceHandle)
  {
    ret = aci_gatt_update_char_value(
        BleApplicationContext.BleApplicationContext_legacy.gapServiceHandle,
        BleApplicationContext.BleApplicationContext_legacy.devNameCharHandle,
        0,
        strlen(name), (uint8_t *) name);
    if (ret != BLE_STATUS_SUCCESS)
    {
      BLE_DBG_SVCCTL_MSG("  Fail   : aci_gatt_update_char_value - Device Name\n");
    }
    else
    {
      BLE_DBG_SVCCTL_MSG("  Success: aci_gatt_update_char_value - Device Name\n");
    }
  }
}

static int8_t ble_count_bonded_devices(void)
{
  uint8_t total = 0;
  Bonded_Device_Entry_t devices[16];
  Identity_Entry_t Private_devices[16];

  tBleStatus ret = aci_gap_configure_whitelist();
  APP_DBG_MSG("\taci_gap_configure_whitelist = 0x%02X\r\n", ret);

  ret = aci_gap_get_bonded_devices(&total, devices);
  if(BLE_STATUS_SUCCESS == ret)
  {
    if(total == 0)
    {
      APP_DBG_MSG("No previous bonded devices\r\n");
    }
    else
    {
      for(uint8_t k = 0; k < total; k++)
      {
        APP_DBG_MSG("Bonded device %d / %d - %s BLE address %02X:%02X:%02X:%02X:%02X:%02X\r\n",
                    k, total,
                    devices[k].Address_Type == 0 ? "Public" : "Random",
                    devices[k].Address[5], devices[k].Address[4], devices[k].Address[3],
                    devices[k].Address[2], devices[k].Address[1], devices[k].Address[0]);
        Private_devices[k].Peer_Identity_Address_Type = devices[k].Address_Type;
        Private_devices[k].Peer_Identity_Address[5] = devices[k].Address[5];
        Private_devices[k].Peer_Identity_Address[4] = devices[k].Address[4];
        Private_devices[k].Peer_Identity_Address[3] = devices[k].Address[3];
        Private_devices[k].Peer_Identity_Address[2] = devices[k].Address[2];
        Private_devices[k].Peer_Identity_Address[1] = devices[k].Address[1];
        Private_devices[k].Peer_Identity_Address[0] = devices[k].Address[0];
      }

      ret = aci_gap_add_devices_to_resolving_list(total, Private_devices, 0);
      if(BLE_STATUS_SUCCESS == ret)
      {
        APP_DBG_MSG("aci_gap_add_devices_to_resolving_list success \r\n");
      }
      else
      {
        APP_DBG_MSG("aci_gap_add_devices_to_resolving_list fail %x \r\n", ret);
      }
    }
  }
  else
  {
    APP_DBG_MSG("ACI_GAP_GET_BONDED_DEVICES error %x\r\n", ret);
    total = -1;
  }
  return total;
}
/* USER CODE END FD_SPECIFIC_FUNCTIONS */
/*************************************************************
 *
 * WRAP FUNCTIONS
 *
 *************************************************************/
void hci_notify_asynch_evt(void* p_Data)
{
  UTIL_SEQ_SetTask(1 << CFG_TASK_HCI_ASYNCH_EVT_ID, CFG_SCH_PRIO_0);

  return;
}

void hci_cmd_resp_release(uint32_t Flag)
{
  UTIL_SEQ_SetEvt(1 << CFG_IDLEEVT_HCI_CMD_EVT_RSP_ID);

  return;
}

void hci_cmd_resp_wait(uint32_t Timeout)
{
  UTIL_SEQ_WaitEvt(1 << CFG_IDLEEVT_HCI_CMD_EVT_RSP_ID);

  return;
}

static void BLE_UserEvtRx(void *p_Payload)
{
  SVCCTL_UserEvtFlowStatus_t svctl_return_status;
  tHCI_UserEvtRxParam *p_param;

